# Data processing for Covid-19's impact in Spain's Hospitals

**Importing libraries**

In [1]:
import pandas as pd
import numpy as np

**Reading the files**

In [3]:
discharges=pd.read_csv('ccaa_covid19_altas_long.csv')

In [4]:
cases=pd.read_csv('ccaa_covid19_casos_long.csv')

In [5]:
deaths=pd.read_csv('ccaa_covid19_fallecidos_long.csv')

In [6]:
hospitalized=pd.read_csv('ccaa_covid19_hospitalizados_long.csv')

In [7]:
ICU=pd.read_csv('ccaa_covid19_uci_long.csv')

In [8]:
masks=pd.read_csv('ccaa_covid19_mascarillas.csv')

In [9]:
ICU_beds_2017=pd.read_csv('ccaa_camas_uci_2017.csv')

In [10]:
national_covid19=pd.read_csv('nacional_covid19.csv')

In [11]:
national_age_gender=pd.read_csv('nacional_covid19_rango_edad.csv')

**Exploring the data**

In [12]:
discharges.head()

        fecha  cod_ine       CCAA  total
0  2020-03-01        1  Andalucía    NaN
1  2020-03-09        1  Andalucía   11.0
2  2020-03-10        1  Andalucía   11.0
3  2020-03-11        1  Andalucía   11.0
4  2020-03-12        1  Andalucía   11.0

In [51]:
discharges.shape

(1368, 4)

In [14]:
cases.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía      0
1  2020-02-22        1  Andalucía      0
2  2020-02-23        1  Andalucía      0
3  2020-02-24        1  Andalucía      0
4  2020-02-25        1  Andalucía      0

In [52]:
cases.shape

(1729, 4)

In [16]:
deaths.head()

        fecha  cod_ine       CCAA  total
0  2020-03-04        1  Andalucía      0
1  2020-03-05        1  Andalucía      0
2  2020-03-06        1  Andalucía      0
3  2020-03-07        1  Andalucía      0
4  2020-03-08        1  Andalucía      0

In [53]:
deaths.shape

(1558, 4)

In [18]:
hospitalized.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía    NaN
1  2020-02-22        1  Andalucía    NaN
2  2020-02-23        1  Andalucía    NaN
3  2020-02-24        1  Andalucía    NaN
4  2020-02-25        1  Andalucía    NaN

In [54]:
hospitalized.shape

(1786, 4)

In [20]:
ICU.head()

        fecha  cod_ine       CCAA  total
0  2020-02-21        1  Andalucía    NaN
1  2020-02-22        1  Andalucía    NaN
2  2020-02-23        1  Andalucía    NaN
3  2020-02-24        1  Andalucía    NaN
4  2020-02-25        1  Andalucía    NaN

In [55]:
ICU.shape

(1786, 4)

In [22]:
masks.head()

        fecha  cod_ine       CCAA  mascarillas_acumulado_desde_2020-03-10
0  2020-03-22      1.0  ANDALUCÍA                                  444083
1  2020-03-22      2.0     ARAGÓN                                   72455
2  2020-03-22      3.0   ASTURIAS                                   60229
3  2020-03-22      4.0   BALEARES                                   49476
4  2020-03-22      5.0   CANARIAS                                  124165

In [56]:
masks.shape

(58, 4)

In [24]:
ICU_beds_2017.head()

   cod_ine                 CCAA  Públicos  Privados  Total
0        1            ANDALUCÍA       572       162    734
1        2               ARAGÓN       113        22    135
2        3             ASTURIAS        86         7     93
3       15  C. FORAL DE NAVARRA        46        19     65
4        5             CANARIAS       187        50    237

In [57]:
ICU_beds_2017.shape

(17, 5)

In [26]:
national_covid19.head()

,fecha,casos_total,casos_pcr,casos_test_ac,altas,fallecimientos,ingresos_uci,hospitalizados
0,2020-02-21,3.0,3,NaN,NaN,NaN,NaN,NaN
1,2020-02-22,3.0,3,NaN,NaN,NaN,NaN,NaN
2,2020-02-23,3.0,3,NaN,NaN,NaN,NaN,NaN
3,2020-02-24,3.0,3,NaN,NaN,NaN,NaN,NaN
4,2020-02-25,4.0,4,NaN,NaN,NaN,NaN,NaN

In [58]:
national_covid19.shape

(263, 8)

In [28]:
national_age_gender.head()

,fecha,rango_edad,sexo,casos_confirmados,hospitalizados,ingresos_uci,fallecidos
0,2020-03-23,0-9,ambos,129,34,1,0
1,2020-03-23,10-19,ambos,221,15,0,1
2,2020-03-23,20-29,ambos,1285,183,8,4
3,2020-03-23,30-39,ambos,2208,365,15,3
4,2020-03-23,40-49,ambos,2919,663,40,9

In [59]:
national_age_gender.shape

(1878, 7)

## Data cleaning steps

**Translating the headers from spanish**

In [30]:
rename_dct = {'fecha': 'date',
             'rango_edad': 'age',
             'sexo': 'gender',
             'casos_confirmados': 'confirmed_cases',
             'hospitalizados': 'hospitalized',
             'fallecidos': 'deceed',
             'ingresos_uci': 'ICU_new_entrances',
             'casos_total': 'total_cases',
             'casos_pcr': 'pcr_cases',
             'altas': 'discharges',
             'casos_test_ac': 'ACtest_cases',
             'fallecimientos': 'deceed',
             'CCAA': 'region',
             'Públicos': 'public',
             'Privados': 'private',
             'mascarillas_acumulado_desde_2020-03-10': 'masks_available_since200310'
             }

#df = df.rename(columns=rename_dct)

def rename_dfs(dfs_lst, rename_dct):
    return [df.rename(columns=rename_dct) for df in dfs_lst]

dfs_lst = [discharges, cases, deaths, hospitalized, ICU, masks, ICU_beds_2017, national_covid19, national_age_gender]

discharges_renamed, cases_renamed, deaths_renamed, hospitalized_renamed, ICU_renamed, masks_renamed, ICU_beds_2017_renamed, national_covid19_renamed, national_age_gender_renamed = rename_dfs(dfs_lst, rename_dct)

discharges_renamed # We are renaming the files

            date  cod_ine     region   total
0     2020-03-01        1  Andalucía     NaN
1     2020-03-09        1  Andalucía    11.0
2     2020-03-10        1  Andalucía    11.0
3     2020-03-11        1  Andalucía    11.0
4     2020-03-12        1  Andalucía    11.0
...          ...      ...        ...     ...
1363  2020-05-14       17   La Rioja  2867.0
1364  2020-05-15       17   La Rioja  2927.0
1365  2020-05-16       17   La Rioja  2990.0
1366  2020-05-17       17   La Rioja  3048.0
1367  2020-05-18       17   La Rioja  3107.0

[1368 rows x 4 columns]

In [31]:
cases_renamed

            date  cod_ine     region  total
0     2020-02-21        1  Andalucía      0
1     2020-02-22        1  Andalucía      0
2     2020-02-23        1  Andalucía      0
3     2020-02-24        1  Andalucía      0
4     2020-02-25        1  Andalucía      0
...          ...      ...        ...    ...
1724  2020-05-17       17   La Rioja   5417
1725  2020-05-18       17   La Rioja   5417
1726  2020-05-19       17   La Rioja   5422
1727  2020-05-20       17   La Rioja   5428
1728  2020-05-21       17   La Rioja   5428

[1729 rows x 4 columns]

In [32]:
national_age_gender_renamed.head()

,date,age,gender,confirmed_cases,hospitalized,ICU_new_entrances,deceed
0,2020-03-23,0-9,ambos,129,34,1,0
1,2020-03-23,10-19,ambos,221,15,0,1
2,2020-03-23,20-29,ambos,1285,183,8,4
3,2020-03-23,30-39,ambos,2208,365,15,3
4,2020-03-23,40-49,ambos,2919,663,40,9

**Dealing with nulls**

In [35]:
# check for number of null values in every column and every file in order to understand our data
discharges_renamed.isna().sum()

date        0
cod_ine     0
region      0
total      24
dtype: int64

In [36]:
cases_renamed.isna().sum()

date       0
cod_ine    0
region     0
total      0
dtype: int64

In [37]:
deaths_renamed.isna().sum()

date       0
cod_ine    0
region     0
total      0
dtype: int64

In [38]:
hospitalized_renamed.isna().sum()

date         0
cod_ine      0
region       0
total      328
dtype: int64

In [39]:
ICU_renamed.isna().sum()

date         0
cod_ine      0
region       0
total      298
dtype: int64

In [40]:
masks_renamed.isna().sum()

date                           0
cod_ine                        1
region                         0
masks_available_since200310    0
dtype: int64

In [41]:
ICU_beds_2017_renamed.isna().sum()

cod_ine    0
region     0
public     0
private    0
Total      0
dtype: int64

In [42]:
national_covid19_renamed.isna().sum()

date                   0
total_cases          172
pcr_cases              0
ACtest_cases         215
discharges           192
deceed                12
ICU_new_entrances     70
hospitalized          68
dtype: int64

In [43]:
national_age_gender_renamed.isna().sum()

date                 0
age                  0
gender               0
confirmed_cases      0
hospitalized         0
ICU_new_entrances    0
deceed               0
dtype: int64

**--> We have been exploring a lot all the files and making sure our understanding of the data collected in them. We arrived at the conclusion that in this particular sanitary topic a gap could potentially be a 0, so a non-deaths value for that day, or a non positive test value for that day, or a non-hospitalized patients value for that day, and so on. So we decided not to delete those rows because they could be significant for our study.**

### Exporting the files to csv

In [33]:
national_age_gender_renamed.to_csv('age_gender_renamed.csv')

In [34]:
cases_renamed.to_csv('cases_renamed.csv')

In [44]:
discharges_renamed.to_csv('discharges_renamed.csv')

In [45]:
deaths_renamed.to_csv('deaths_renamed.csv')

In [46]:
hospitalized_renamed.to_csv('hospitalized_renamed.csv')

In [47]:
ICU_renamed.to_csv('ICU_renamed.csv')

In [48]:
masks_renamed.to_csv('masks_renamed.csv')

In [49]:
ICU_beds_2017_renamed.to_csv('ICU_beds_2017_renamed.csv')

In [50]:
national_covid19_renamed.to_csv('national_covid19_renamed.csv')